Repository: panSlota/MSLearning-BC
Catalog: TryFunctions/Translations/TryFunctions.*.xlf
Languages: cs_cz

# Table 3530793196 - Property 2879900210
source: Record Primary Key Value
cs_cz: Hodnota primárního klíče záznamu

# Table 3530793196 - Field 3461834954 - Property 2879900210
source: Description
cs_cz: Popis

# Table 3530793196 - Field 3618188786 - Property 2879900210
source: Field Length
cs_cz: Délka pole

# Table 3530793196 - Field 3531868071 - Property 2879900210
source: Field No.
cs_cz: Číslo pole

# Table 3530793196 - Field 3320823955 - Property 2879900210
source: Line No.
cs_cz: Číslo řádku

# Table 3530793196 - Field 2961552353 - Property 2879900210
source: Name
cs_cz: Název

# Table 3530793196 - Field 56735747 - Property 2879900210
source: Position
cs_cz: Pozice

# Table 3530793196 - Field 3135334477 - Property 2879900210
source: Table ID
cs_cz: ID tabulky

# Table 3530793196 - Field 4293380794 - Property 2879900210
source: Transaction Setup Code
cs_cz: Kód nastavení transakcí

# Table 3530793196 - Field 1878130204 - Property 2879900210
source: Type
cs_cz: Typ

# Table 3530793196 - Field 2463291169 - Property 2879900210
source: Type Name
cs_cz: Název typu

# Table 3530793196 - Field 1131619133 - Property 2879900210
source: Value
cs_cz: Hodnota

# Table 56370850 - Property 2879900210
source: Transaction Setup
cs_cz: Nastavení transakcí

# Table 56370850 - Field 3004954119 - Property 2879900210
source: Code
cs_cz: Kód

# Table 56370850 - Field 3910324415 - Property 2879900210
source: Default Action
cs_cz: Výchozí akce

# Table 56370850 - Field 2185684127 - Property 2879900210
source: ID Filter
cs_cz: Filtr ID

# Table 56370850 - Field 3388782392 - Property 2879900210
source: Run TryFunction
cs_cz: Spustit TryFunction

# Table 1064750771 - Property 2879900210
source: Transaction Worksheet Line
cs_cz: Řádek sešitu transakcí

# Table 1064750771 - Field 1060207642 - Property 2879900210
source: Action
cs_cz: Akce

# Table 1064750771 - Field 2792604300 - Property 2879900210
source: Consume TryFunction Result
cs_cz: Použít návratovou hodnotu TryFunction

# Table 1064750771 - Field 1295821103 - Property 2879900210
source: Defined PK Checked
cs_cz: Definovaný PK zkontrolován

# Table 1064750771 - Field 3846862522 - Property 2879900210
source: Last Run Time
cs_cz: Poslední čas běhu

# Table 1064750771 - Field 3320823955 - Property 2879900210
source: Line No.
cs_cz: Číslo řádku

# Table 1064750771 - Field 110196708 - Property 2879900210
source: No. of PK Fields Missing
cs_cz: Počet chybějících polí PK

# Table 1064750771 - Field 472338107 - Property 2879900210
source: Result
cs_cz: Výsledek

# Table 1064750771 - Field 3535442407 - Property 2879900210
source: Result Reason
cs_cz: Důvod výsledku

# Table 1064750771 - Field 3388782392 - Property 2879900210
source: Run TryFunction
cs_cz: Spustit TryFunction

# Table 1064750771 - Field 3135334477 - Property 2879900210
source: Table ID
cs_cz: ID tabulky

# Table 1064750771 - Field 3808951907 - Property 2879900210
source: Table Name
cs_cz: Název tabulky

# Table 1064750771 - Field 561240882 - Property 2879900210
source: Throw Error
cs_cz: Vyvolat chybu

# Table 1064750771 - Field 4293380794 - Property 2879900210
source: Transaction Setup Code
cs_cz: Kód nastavení transakcí

# Codeunit 3716033428 - NamedType 3472628514
source: delete
cs_cz: mazání

# Codeunit 2289604922 - NamedType 3472628514
source: insert
cs_cz: vkládání

# Codeunit 3159004227 - NamedType 3472628514
source: modify
cs_cz: modifikace

# Codeunit 725930405 - NamedType 3472628514
source: read
cs_cz: čtení

# Codeunit 2736272780 - NamedType 3543523789
source: No table with ID %1 has been found.
cs_cz: Nebyla nalezena žádná tabulka s ID %1.

# Codeunit 2736272780 - Method 2915238519 - NamedType 848472796
source: An error occured during the %1 process.
cs_cz: Vyskytla se chyba během procesu %1.

# Page 2621362954 - Property 2879900210
source: Record Primary Keys Values
cs_cz: Hodnoty primárního klíče záznamu

# Page 2621362954 - Control 3461834954 - Property 1295455071
source: Specifies the description.
cs_cz: Určuje popis.

# Page 2621362954 - Control 2961552353 - Property 1295455071
source: Specifies the name of the field.
cs_cz: Určuje název pole.

# Page 2621362954 - Control 1878130204 - Property 1295455071
source: Specifies the name of the data type of the field.
cs_cz: Určuje název datového typu pole.

# Page 2621362954 - Control 1131619133 - Property 1295455071
source: Specifies the value of the field.
cs_cz: Určuje hodnotu pole.

# Page 3964187677 - Property 2879900210
source: Record Primary Key Values
cs_cz: Hodnoty primárního klíče tabulky

# Page 3964187677 - Control 3461834954 - Property 1295455071
source: Specifies the description.
cs_cz: Určuje popis.

# Page 3964187677 - Control 3531868071 - Property 1295455071
source: Specifies the number of the field.
cs_cz: Určuje číslo pole.

# Page 3964187677 - Control 2961552353 - Property 1295455071
source: Specifies the name of the field.
cs_cz: Určuje název pole.

# Page 3964187677 - Control 56735747 - Property 1295455071
source: Specifies the position of the field in the primary key.
cs_cz: Určuje pozici pole v primárním klíči.

# Page 3964187677 - Control 1878130204 - Property 1295455071
source: Specifies the name of the data type of the field.
cs_cz: Určuje název datového typu pole.

# Page 3964187677 - Control 1131619133 - Property 1295455071
source: Specifies the value of the field.
cs_cz: Určuje hodnotu pole.

# Page 56370850 - Property 2879900210
source: Transaction Setup
cs_cz: Nastavení transakcí

# Page 56370850 - Control 3004954119 - Property 1295455071
source: Specifies the code of the setup.
cs_cz: Určuje kód nastavení.

# Page 56370850 - Control 3910324415 - Property 1295455071
source: Specifies the default aciton. This action is applied when suggesting lines in the worksheet.
cs_cz: Určuje výchozí akci. Tato akce bude přiřazena k řádkům při použití funkce "Navrhnout řádky".

# Page 56370850 - Control 2185684127 - Property 1295455071
source: Specifies the Object ID filter for the tables.
cs_cz: Určuje filtr ID tabulek.

# Page 56370850 - Control 3388782392 - Property 1295455071
source: Specifies if the operation should be run inside a TryFunction.
cs_cz: Určuje, zda má být operace spuštěna uvnitř TryFunction.

# Page 2179994353 - Property 2879900210
source: Transaction Worksheet
cs_cz: Sešit transakcí

# Page 2179994353 - Control 1060207642 - Property 1295455071
source: Specifies the action to perform on the table.
cs_cz: Určuje akci, která má být provedena nad tabulkou v řádku.

# Page 2179994353 - Control 2792604300 - Property 1295455071
source: Specifies whether the TryFunction return value should be consumed (i.e. wrapped in a conditional statement or assigned to a variable).
cs_cz: Určuje, zda má být výsledek běhu TryFunction použit (tzn. přiřazen do proměnné nebo obalen do podmínky).

# Page 2179994353 - Control 1295821103 - Property 1295455071
source: Specifies if the primary key values have been checked.
cs_cz: Určuje, zda byly zkontrolovány hodnoty PK.

# Page 2179994353 - Control 3846862522 - Property 1295455071
source: Specifies the last date and time the transaction has been executed.
cs_cz: Určuje poslední datum a čas spuštění operace.

# Page 2179994353 - Control 110196708 - Property 1295455071
source: Specifies the number of primary key fields missing from the definition.
cs_cz: Určuje počet polí PK, které oproti definici dané tabulky chybí.

# Page 2179994353 - Control 472338107 - Property 1295455071
source: Specifies the result of the transaction run.
cs_cz: Určuje výsledek běhu transakce.

# Page 2179994353 - Control 3535442407 - Property 1295455071
source: Specifies the reason why the transaction failed.
cs_cz: Určuje důvod neúspěšného běhu transakce.

# Page 2179994353 - Control 3388782392 - Property 1295455071
source: Specifies if the operation should be run inside a TryFunction.
cs_cz: Určuje, zda má být operace spuštěna uvnitř TryFunction.

# Page 2179994353 - Control 3135334477 - Property 1295455071
source: Specifies the ID of the table on which the transaction is being executed.
cs_cz: Určuje ID tabulky, nad kterou bude transakce spuštěna.

# Page 2179994353 - Control 3808951907 - Property 1295455071
source: Specifies the name of the table.
cs_cz: Určuje název tabulky.

# Page 2179994353 - Control 561240882 - Property 1295455071
source: Specifies if an error should be thrown during the transaction.
cs_cz: Určuje, zda by během operace měla být vyvolána chyba.

# Page 2179994353 - Control 4293380794 - Property 1295455071
source: Specifies the code of the setup.
cs_cz: Určuje kód nastavení.

# Page 2179994353 - Control 4293380794 - Property 2879900210
source: Transaction Setup Code
cs_cz: Kód nastavení transakcí

# Page 2179994353 - Action 2231518605 - Property 1295455071
source: Opens the primary key values for the selected table.
cs_cz: Otevře seznam hodnot primárního kláče pro danou tabulku.

# Page 2179994353 - Action 2231518605 - Property 2879900210
source: Primary Key Values
cs_cz: Hodnoty primárního klíče

# Page 2179994353 - Action 426928638 - Property 2879900210
source: Preparations
cs_cz: Přípravy

# Page 2179994353 - Action 2775591071 - Property 1295455071
source: Checks the primary key values for the selected table.
cs_cz: Zkontroluje, že byl uveden správný počet polí PK a že mají správné hodnoty.

# Page 2179994353 - Action 2775591071 - Property 2879900210
source: Check Primary Key Values
cs_cz: Zkontrolovat hodnoty PK

# Page 2179994353 - Action 1386367117 - Property 1295455071
source: Clears all results of the transaction runs from the worksheet.
cs_cz: Vymaže všechny výsledky běhů transakcí v daném sešitu.

# Page 2179994353 - Action 1386367117 - Property 2879900210
source: Clear Results
cs_cz: Vymazat výsledky

# Page 2179994353 - Action 2406315884 - Property 1295455071
source: Deletes all lines from the worksheet.
cs_cz: Smaže všechny řádky sešitu.

# Page 2179994353 - Action 2406315884 - Property 2879900210
source: Delete All
cs_cz: Smazat vše

# Page 2179994353 - Action 1384210787 - Property 1295455071
source: Suggests all operations for the current table.
cs_cz: Navrhne všechny operace pro tabulku v daném řádku.

# Page 2179994353 - Action 1384210787 - Property 2879900210
source: Suggest Lines
cs_cz: Návrh řádků

# Page 2179994353 - Action 2099597673 - Property 2879900210
source: Transactions
cs_cz: Transakce

# Page 2179994353 - Action 2958710393 - Property 1295455071
source: Runs all transactions for the current sheet.
cs_cz: Spustí transakce pro všechny řádky sešitu.

# Page 2179994353 - Action 2958710393 - Property 2879900210
source: Run All Transactions
cs_cz: Spustit všechny transakce

# Page 2179994353 - Action 2140890127 - Property 1295455071
source: Runs the transaction for the selected lines.
cs_cz: Spustí transakce nad vybranými řádky.

# Page 2179994353 - Action 2140890127 - Property 2879900210
source: Run Transaction
cs_cz: Spustit transakci

# Page 2179994353 - Action 436407473 - Property 2879900210
source: Navigation
cs_cz: Související

# Page 2179994353 - Action 3590497249 - Property 2879900210
source: Preparations
cs_cz: Přípravy

# Page 2179994353 - Action 3312973166 - Property 2879900210
source: Transactions
cs_cz: Transakce

# Page 1439666858 - Property 2879900210
source: TryFunction Test
cs_cz: Testování TryFunction

# Page 1439666858 - Method 52072362 - NamedType 3182483960
source: ThrowError = %1, ConsumeResult = %2
cs_cz: Vypálit chybu = %1, Použít návratovou hodnotu: %2

# Page 1439666858 - Control 2445482498 - Property 2879900210
source: General
cs_cz: Obecné

# Page 1439666858 - Action 3781836200 - Property 1295455071
source: Executes a TryFunction, attempts to modfiy a record and then raises na exception.
cs_cz: Vykoná funkci s atributem [TryFunction()], pokusí se modifikovat záznam a potom vyhodí chybu.

# Page 1439666858 - Action 3781836200 - Property 2879900210
source: TryFunction DBWrite Error
cs_cz: Zápis do DB uvnitř TryFunction s chybou

# Page 1439666858 - Action 4018307779 - Property 1295455071
source: Executes a TryFunction without error.
cs_cz: Vykoná kód uvnitř TryFunction bez chyby.

# Page 1439666858 - Action 4018307779 - Property 2879900210
source: TryFunction Without Error
cs_cz: TryFunction bez chyby

# Enum 2203464042 - EnumValue 2477294019 - Property 2879900210
source: Delete
cs_cz: Odstranit

# Enum 2203464042 - EnumValue 2049086889 - Property 2879900210
source: Insert
cs_cz: Vložit

# Enum 2203464042 - EnumValue 3817527484 - Property 2879900210
source: Modify
cs_cz: Změnit

# Enum 2203464042 - EnumValue 2119658478 - Property 2879900210
source: Read
cs_cz: Číst

# Enum 2208083027 - EnumValue 2108159406 - Property 2879900210
source: Fail
cs_cz: Chyba

# Enum 2208083027 - EnumValue 1327490294 - Property 2879900210
source: Fail Consumed
cs_cz: Chyba - použito

# Enum 2208083027 - EnumValue 3878926381 - Property 2879900210
source: Success
cs_cz: Úspěch

# Enum 2208083027 - EnumValue 4225442797 - Property 2879900210
source: Success Consumed
cs_cz: Úspěch - použito
